app/Controllers/C_login_pelanggan.php

    public function login()
    {
        $session = session();
        $model = new M_login_pelanggan();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `pelanggan`
WHERE `username` = 'syafiq'
 LIMIT 1