app/Controllers/C_pelanggan.php

    public function index()
    {
        $db = \Config\Database::connect();
        $data['judul_halaman'] = 'Data Pelanggan';
        $data['data'] = $db->table('pelanggan')->get()->getResult();
---
SELECT *
FROM `pelanggan`