app/Controllers/C_pemesanan.php

    public function add()
    {
        $model = new M_faktur();
        $db   = \Config\Database::connect();
        $data['judul_halaman'] = 'Tambah Pemesanan';
        $data['no_faktur'] = $model->get_faktur_pesanan();
        $data['barang'] = $db->table('barang')->get()->getResult();
        $data['pelanggan'] = $db->table('pelanggan')->get()->getResult();
---
SELECT *
FROM `barang`
SELECT *
FROM `pelanggan`

    public function save_temp()
    {
        $db   = \Config\Database::connect();
        $dt['id_pelanggan'] = $this->request->getVar('id_pelanggan');
        $id_barang = $this->request->getVar('id_barang');
        $data = [
            'id_pelanggan' => $this->request->getVar('id_pelanggan'),
            'id_barang' => $this->request->getVar('id_barang'),
            'nama_barang' => $this->request->getVar('nama_barang'),
            'harga' => $this->request->getVar('harga'),
            'qty' => $this->request->getVar('qty'),
        ];
        $db->table('temp_pesan')->insert($data);
        $barang = $db->table('barang')->getWhere(['id' => $id_barang])->getRow();
        $stok = $barang->stok - $this->request->getVar('qty');
        $data = [
            'stok' => $stok,
        ];
        $db->table('barang')->update($data, array('id' => $id_barang));
---
INSERT INTO `temp_pesan` (`id_pelanggan`, `id_barang`, `nama_barang`, `harga`, `qty`) VALUES ('3', '8', 'Buku', '50000', '1')
SELECT *
FROM `barang`
WHERE `id` = '8'
UPDATE `barang` SET `stok` = 65
WHERE `id` = '8'

    public function list_barang()
    {
        $db   = \Config\Database::connect();
        $data['barang'] = $db->table('barang')->get()->getResult();
---
SELECT *
FROM `barang`