app/Controllers/C_pemesanan_front.php

SELECT *, `pemesanan`.`id` as `id_pemesanan`
FROM `pemesanan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id`=`pemesanan`.`id_pelanggan`
WHERE `pelanggan`.`id` = '4'
ORDER BY `pemesanan`.`tanggal` DESC
---
    public function index()
    {
        $db   = \Config\Database::connect();
        $session = session();
        $data['judul_halaman'] = 'Data Pemesanan';
        $data['data'] = $db->table('pemesanan')->select('*,pemesanan.id as id_pemesanan')
            ->join('pelanggan', 'pelanggan.id=pemesanan.id_pelanggan', 'left')
            ->where('pelanggan.id', $session->id)
            ->orderBy('pemesanan.tanggal', 'desc')
            ->get()->getResult();

SELECT *
FROM `barang`
---
    public function list_barang()
    {
        $db   = \Config\Database::connect();
        $data['barang'] = $db->table('barang')->get()->getResult();